namespace MorseSharp
{
    /*
    All characters except Kurdish, KurdishLatin
    Russian, sourced from https://morsedecoder.com/.
    Please if you notice any incorrectness in the characters feel free to
    Submit an issue in this repository https://github.com/p6laris/MorseSharp.
    */
    
    /// <summary>
    /// Defines all morse characters.
    /// </summary>
    public static class MorseCharacters
    {

        /// <summary>
        /// Gets a collection of a morse code characters for the given language.
        /// </summary>
        /// <param name="Language">The <see cref="MorseSharp.Language"/> </param>
        /// <returns><see cref="System.Collections.Generic.Dictionary{Char, String}"></see> of morse characters.</returns>
        /// <exception cref="ArgumentOutOfRangeException"></exception>
        public static Dictionary<char, string> GetLanguageCharacter(Language Language) => Language switch
        {
            Language.English => GetMorseCharactersEnglish(),
            Language.Kurdish => GetMorseCharactersKurdish(),
            Language.KurdishLatin => GetMorseCharactersKurdishLatin(),
            Language.Arabic => GetMorseCharactersArabic(),
            Language.Deutsch => GetMorseCharactersDeutsch(),
            Language.Espanol => GetMorseCharactersEspanol(),
            Language.Francais => GetMorseCharactersFrancais(),
            Language.Italiano => GetMorseCharactersItaliano(),
            Language.Japanese => GetMorseCharactersJapanese(),
            Language.Portugues => GetMorseCharactersPortugues(),
            Language.Russian => GetMorseCharactersRussian(),
            _ => throw new ArgumentOutOfRangeException(nameof(Language))
        };
        /// <summary>
        /// Defines all morse characters in English.
        /// </summary>
        /// <returns><see cref="System.Collections.Generic.Dictionary{char, string}"></see> of morse characters.</returns>
        private static Dictionary<char, string> GetMorseCharactersEnglish()
        {
            return new Dictionary<char, string>()
            {
                //Alphabets
                { 'A', ".-" },
                { 'B', "-..." },
                { 'C', "-.-." },
                { 'D', "-.."},
                { 'E', "." },
                { 'F', "..-." },
                { 'G', "--." },
                { 'H', "...." },
                { 'I', ".." },
                { 'J', ".---" },
                { 'K', "-.-" },
                { 'L', ".-.." },
                { 'M', "--" },
                { 'N', "-." },
                { 'O', "---" },
                { 'P', ".--." },
                { 'Q', "--.-" },
                { 'R', ".-." },
                { 'S', "..." },
                { 'T', "-" },
                { 'U', "..-" },
                { 'V', "...-" },
                { 'W', ".--"},
                { 'X', "-..-" },
                { 'Y', "-.--" },
                { 'Z', "--.." },
                //Numerics
                { '1', ".----" },
                { '2', "..---" },
                { '3', "...--" },
                { '4', "....-" },
                { '5', "....." },
                { '6', "-...." },
                { '7', "--..." },
                { '8', "---.." },
                { '9', "----." },
                { '0', "-----" },
                //Space
                {' ', "/" },
                //Punctuation
                {'.',".-.-.-" },
                {',',"--..--" },
                {'?',"..--.." },
                {';',"-.-.-." },
                {':',"---..." },
                {'/',"-..-."},
                {'\'',".----." },
                {'\"',".-..-." },
                //Special Characters
                {'_',"..--.-"},
                {'+',".-.-." },
                {'-',"-....-" },
                {'*',"-..-" },
                {'=',"-...-" },
                {')',"-.--.-" },
                {'(',"-.--." },
                {'$',"...-..-" },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'&',".-..." },
                {'@',".--.-." },
                {'!', "-.-.--"} 
        };
        }
        
        /// <summary>
        /// Defines all morse characters in Kurdish.
        /// </summary>
        /// <returns><see cref="System.Collections.Generic.Dictionary{Char, String}"></see> of morse characters.</returns>
        private static Dictionary<char, string> GetMorseCharactersKurdish()
        {
            return new Dictionary<char, string>()
            {
                //Alphabets
                {'ا',".-" },
                {'ب',"-..." },
                {'پ',".--." },
                {'ت',"-" },
                {'ج',".---" },
                {'چ',"---." },
                {'ح',"...." },
                {'خ',"-..-" },
                {'د',"-.." },
                {'ر',"-.-" },
                {'ڕ',".-." },
                {'ز',"--.." },
                {'ژ',"--." },
                {'س',"..." },
                {'ش',"----" },
                {'ع',"---" },
                {'غ',"..--" },
                {'ف',"..-." },
                {'ڤ',"..-.." },
                {'ق',"...---" },
                {'ک',"-...." },
                {'گ',"--.-" },
                {'ل',".-.." },
                {'ڵ',"...-" },
                {'م',"--" },
                {'ن',"-." },
                {'ه',"-.-." },
                {'ە',"." },
                {'و',".--" },
                {'ۆ',".-.-" },
                {'ی',".." },
                {'ێ',"..-" },
                {'ئ',"..-.." },

                //Numbers
                {'١',".----" },
                {'٢',"..---" },
                {'٣',"...--" },
                {'٤',"....-" },
                {'٥',"....." },
                {'٦',"-...." },
                {'٧',"--..." },
                {'٨',"---.." },
                {'٩',"----." },
                {'٠',"-----" },
                //Space
                {' ', "/" },
                //Punctuation
                {'.',".-.-.-." },
                {'،',"--..--" },
                {'؟',"..--.." },
                {':',"---..." },
                {'-',"-....-" },
                {'/',"-..-." },
                {'\'',".----." },
                {'\"',".-..-." },
                {'؛',"-.-.-." },
                //Special Characters
                {'_',"..--.-" },
                {'+',".-.-." },
                {'*',"-..-" },
                {'=',"-...-" },
                {')',"-.--.-" },
                {'(',"-.--." },
                {'$',"...-..-" },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'&',".-..." },
                {'@',".--.-." },
                {'!', "-.-.--"} 

        };
        }
        // <summary>
        /// Defines all morse characters in Kurdish Latin.
        /// </summary>
        /// <returns><see cref="System.Collections.Generic.Dictionary{Char, String}"></see> of morse characters.</returns>
        private static Dictionary<char, string> GetMorseCharactersKurdishLatin()
        {
            return new Dictionary<char, string>()
            {
                 //Alphabets
                {'A',".-" },
                {'B',"-..." },
                {'P',".--." },
                {'T',"-" },
                {'C',".---" },
                {'Ç',"---." },
                {'Ü',"...." },
                {'X',"-..-" },
                {'D',"-.." },
                {'R',"-.-" },
                {'Ř',".-." },
                {'Z',"--.." },
                {'J',"--." },
                {'S',"..." },
                {'Ş',"----" },
                {'W',"---" },
                {'Y',"..--" },
                {'F',"..-." },
                {'V',"..-.." },
                {'Ň',"...---" },
                {'K',"-...." },
                {'G',"--.-" },
                {'L',".-.." },
                {'Ł',"...-" },
                {'M',"--" },
                {'N',"-." },
                {'H',"-.-." },
                {'E',"." },
                {'U',".--" },
                {'Û',".--.--" },
                {'O',".-.-" },
                {'Î',".." },
                {'Ê',"..-" },
                {'I',"..-.." },

                //Numbers
                {'1',".----" },
                {'2',"..---" },
                {'3',"...--" },
                {'4',"....-" },
                {'5',"....." },
                {'6',"-...." },
                {'7',"--..." },
                {'8',"---.." },
                {'9',"----." },
                {'0',"-----" },
                //Space
                {' ', "/" },
                //Punctuation
                {'.',".-.-.-." },
                {'،',"--..--" },
                {'؟',"..--.." },
                {':',"---..." },
                {'-',"-....-" },
                {'/',"-..-." },
                {'\'',".----." },
                {'\"',".-..-." },
                {'؛',"-.-.-." },
                //Special Characters
                {'_',"..--.-" },
                {'+',".-.-." },
                {'*',"-..-" },
                {'=',"-...-" },
                {')',"-.--.-" },
                {'(',"-.--." },
                {'$',"...-..-" },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'&',".-..." },
                {'@',".--.-." },
                {'!', "-.-.--"} 
        };
        }
        /// <summary>
        /// Defines all morse characters in Arabic.
        /// </summary>
        /// <returns><see cref="System.Collections.Generic.Dictionary{TKey, TValue}"></see> of morse characters.</returns>
        private static Dictionary<char, string> GetMorseCharactersArabic()
        {
            return new Dictionary<char, string>
            {
                //Alphabe
                { 'ا', ".-" },
                { 'ب', "-..." },
                { 'ت', "-" },
                { 'ث', "-.-." },
                { 'ج', ".---" },
                { 'ح', "...." },
                { 'خ', "---" },
                { 'د', "-.." },
                { 'ذ', "--.." },
                { 'ر', ".-." },
                { 'ز', "---." },
                { 'س', "..." },
                { 'ش', "----" },
                { 'ص', "-..-" },
                { 'ض', "...-" },
                { 'ط', "..-" },
                { 'ظ', "-.--" },
                { 'ع', ".-.-" },
                { 'غ', "--." },
                { 'ف', "..-." },
                { 'ق', "--.-" },
                { 'ك', "-.-" },
                { 'ل', ".-.." },
                { 'م', "--" },
                { 'ن', "-." },
                { 'ه', "..-.." },
                { 'و', ".--" },
                { 'ي', ".." },
                { 'ء', "." },
                //Numerics
                { '1', ".----" },
                { '2', "..---" },
                { '3', "...--" },
                { '4', "....-" },
                { '5', "....." },
                { '6', "-...." },
                { '7', "--..." },
                { '8', "---.." },
                { '9', "----." },
                { '0', "-----" },
                //Space
                { ' ', "/" },
                //Punctuation
                { '.', ".-.-.-" },
                { '،', "--..--" },
                { '؟', "..--.." },
                { '؛', "-.-.-." },
                { ':', "---..." },
                { '/', "-..-." },
                { '‘', ".----." },
                { '\"', ".-..-." },
                //Special Characters
                { '_', "..--.-" },
                { '+', ".-.-." },
                { '-', "-....-" },
                { '*', "-..-" },
                { '=', "-...-" },
                { ')', "-.--.-" },
                { '(', "-.--." },
                {'$',"...-..-" },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'&',".-..." },
                {'@',".--.-." },
                {'!', "-.-.--"} 
            };
        }
        /// <summary>
        /// Defines all morse characters in Deutsch.
        /// </summary>
        /// <returns><see cref="System.Collections.Generic.Dictionary{TKey, TValue}"></see> of morse characters.</returns>
        private static Dictionary<char, string> GetMorseCharactersDeutsch()
        {
            return new Dictionary<char, string>
            {
                //Alphabets
                {'A',".-" },
                {'B',"-..." },
                {'C',"-.-." },
                {'D',"-.." },
                {'E',"." },
                {'F',"..-." },
                {'G',"--." },
                {'H',"...." },
                {'I',".." },
                {'J',".---" },
                {'K',"-.-" },
                {'L',".-.." },
                {'M',"--" },
                {'N',"-." },
                {'O',"---" },
                {'P',".--." },
                {'Q',"--.-" },
                {'R',"-.-" },
                {'S',"..." },
                {'T',"-" },
                {'U',"..-" },
                {'V',"...-" },
                {'W',".--" },
                {'X',"-..-" },
                {'Y',"-.--" },
                {'Z',"--.." },
                {'Ä',".-.-" },
                {'Ö',"---." },
                {'ẞ',"......" },
                {'Ü',"..--" },
                //Numerics
                { '1', ".----" },
                { '2', "..---" },
                { '3', "...--" },
                { '4', "....-" },
                { '5', "....." },
                { '6', "-...." },
                { '7', "--..." },
                { '8', "---.." },
                { '9', "----." },
                { '0', "-----" },
                 //Space
                { ' ', "/" },
                //Punctuation
                {'.',".-.-.-" },
                {',',"--..--" },
                {'?',"..--.." },
                {';',"-.-.-." },
                {':',"---..." },
                {'/',"-..-."},
                {'\'',".----." },
                {'\"',".-..-." },
                //Special Characters
                {'_',"..--.-"},
                {'+',".-.-." },
                {'-',"-....-" },
                {'*',"-..-" },
                {'=',"-...-" },
                {'(',"-.--.-" },
                {')',"-.--." },
                {'$',"...-..-" },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'&',".-..." },
                {'@',".--.-." },
                {'!', "-.-.--"} 
            };
        }

        /// <summary>
        /// Defines all morse characters in Espanol.
        /// </summary>
        /// <returns><see cref="System.Collections.Generic.Dictionary{TKey, TValue}"></see> of morse characters.</returns>
        private static Dictionary<char, string> GetMorseCharactersEspanol()
        {

            return new Dictionary<char, string>()
            {
                //Alphabets
                {'A',".-"},
                {'B',"-..." },
                {'C',"-.-."},
                {'D',"-.." },
                {'E',"." },
                {'F',"..-." },
                {'G',"--." },
                {'H',"...." },
                {'I',".." },
                {'J',".---" },
                {'K',"-.-" },
                {'L',".-.." },
                {'M',"--" },
                {'N',"-." },
                {'O',"---" },
                {'P',".--." },
                {'Q',"--.-" },
                {'R',".-." },
                {'S',"..." },
                {'T',"-" },
                {'U',"..-" },
                {'V',"...-" },
                {'W',".--" },
                {'X',"-..-" },
                {'Y',"-.--" },
                {'Z',"--.." },
                {'Á',".--.-" },
                {'É',"..-.." },
                {'Ñ',"--.--" },
                {'Ó',"---." },

                //Numerics
                { '1', ".----" },
                { '2', "..--" },
                { '3', "...--" },
                { '4', "....-" },
                { '5', "....." },
                { '6', "-...." },
                { '7', "--..." },
                { '8', "---.." },
                { '9', "----." },
                { '0', "-----" },
                //Space
                {' ', "/" },
                //Punctuation
                {'.',".-.-.-" },
                {',',"--..--" },
                {'?',"..--.." },
                {';',"-.-.-." },
                {':',"---..." },
                {'/',"-..-."},
                {'\'',".----." },
                {'\"',".-..-." },

                {'&',".-..." },
                {'$',"...-..-" },
                {'@',".--.-." },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'!', "-.-.--"}, 

                //Special Characters
                {'_',"..--.-"},
                {'+',".-.-." },
                {'-',"-....-" },
                {'*',"-..-" },
                {'=',"-...-" },
                {')',"-.--.-" },
                {'(',"-.--." }
            };
        }

        /// <summary>
        /// Defines all morse characters in Francais.
        /// </summary>
        /// <returns><see cref="System.Collections.Generic.Dictionary{TKey, TValue}"></see> of morse characters.</returns>
        private static Dictionary<char, string> GetMorseCharactersFrancais()
        {

            return new Dictionary<char, string>()
            {
                //Alphabets
                {'A',".-"},
                {'B',"-..." },
                {'C',"-.-."},
                {'D',"-.." },
                {'E',"." },
                {'F',"..-." },
                {'G',"--." },
                {'H',"...." },
                {'I',".." },
                {'J',".---" },
                {'K',"-.-" },
                {'L',".-.." },
                {'M',"--" },
                {'N',"-." },
                {'O',"---" },
                {'P',".--." },
                {'Q',"--.-" },
                {'R',".-." },
                {'S',"..." },
                {'T',"-" },
                {'U',"..-" },
                {'V',"...-" },
                {'W',".--" },
                {'X',"-..-" },
                {'Y',"-.--" },
                {'Z',"--.." },

                {'À',".--.-" },
                {'Â',".--.-" },
                {'Æ',".-.-" },
                {'Ç',"-.-.." },
                {'È',".-..-" },
                {'Ë',"..-.." },
                {'É',"..-.." },
                {'Ê',"-..-." },
                {'Ï',"-..--" },
                {'Ô',"---." },
                {'Ü',"..--" },
                {'Ù',"..--" },

                //Numerics
                { '1', ".----" },
                { '2', "..--" },
                { '3', "...--" },
                { '4', "....-" },
                { '5', "....." },
                { '6', "-...." },
                { '7', "--..." },
                { '8', "---.." },
                { '9', "----." },
                { '0', "-----" },
                //Space
                {' ', "/" },
                //Punctuation
                {'.',".-.-.-" },
                {',',"--..--" },
                {'?',"..--.." },
                {';',"-.-.-." },
                {':',"---..." },
                {'/',"-..-."},
                {'\'',".----." },
                {'\"',".-..-." },
                {'&',".-..." },
                {'$',"...-..-" },
                {'@',".--.-." },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'!', "-.-.--"},
                //Special Characters
                {'_',"..--.-"},
                {'+',".-.-." },
                {'-',"-....-" },
                {'*',"-..-" },
                {'=',"-...-" },
                {')',"-.--.-" },
                {'(',"-.--." }
            };
        }

        /// <summary>
        /// Defines all morse characters in Italiano.
        /// </summary>
        /// <returns><see cref="System.Collections.Generic.Dictionary{TKey, TValue}"></see> of morse characters.</returns>
        private static Dictionary<char, string> GetMorseCharactersItaliano()
        {

            return new Dictionary<char, string>()
            {
                //Alphabets
                {'A',".-"},
                {'B',"-..." },
                {'C',"-.-."},
                {'D',"-.." },
                {'E',"." },
                {'F',"..-." },
                {'G',"--." },
                {'H',"...." },
                {'I',".." },
                {'J',".---" },
                {'K',"-.-" },
                {'L',".-.." },
                {'M',"--" },
                {'N',"-." },
                {'O',"---" },
                {'P',".--." },
                {'Q',"--.-" },
                {'R',".-." },
                {'S',"..." },
                {'T',"-" },
                {'U',"..-" },
                {'V',"...-" },
                {'W',".--" },
                {'X',"-..-" },
                {'Y',"-.--" },
                {'Z',"--.." },
                {'À',".--.-" },
                {'É',"..-.." },
                {'È',".-..-" },
                {'Ì',".---." },
                {'Ó',"---." },
                {'Ò',"---." },
                {'Ù',"..--" },

                //Numerics
                { '1', ".----" },
                { '2', "..--" },
                { '3', "...--" },
                { '4', "....-" },
                { '5', "....." },
                { '6', "-...." },
                { '7', "--..." },
                { '8', "---.." },
                { '9', "----." },
                { '0', "-----" },
                //Space
                {' ', "/" },
                //Punctuation
                {'.',".-.-.-" },
                {',',"--..--" },
                {'?',"..--.." },
                {';',"-.-.-." },
                {':',"---..." },
                {'/',"-..-."},
                {'\'',".----." },
                {'\"',".-..-." },
                {'&',".-..." },
                {'$',"...-..-" },
                {'@',".--.-." },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'!', "-.-.--"},

                //Special Characters
                {'_',"..--.-"},
                {'+',".-.-." },
                {'-',"-....-" },
                {'*',"-..-" },
                {'=',"-...-" },
                {')',"-.--.-" },
                {'(',"-.--." }
            };
        }

        /// <summary>
        /// Defines all morse characters in Japanese.
        /// </summary>
        /// <returns><see cref="System.Collections.Generic.Dictionary{TKey, TValue}"></see> of morse characters.</returns>
        private static Dictionary<char, string> GetMorseCharactersJapanese()
        {

            return new Dictionary<char, string>()
            {
                //Alphabets
                {'ア',"--.--"},
                {'カ',".-.."},
                {'サ',"-.-.-"},
                {'タ',"-."},
                {'ナ',".-."},
                {'ハ',"-..." },
                {'マ',"-..-"},
                {'ヤ',".--"},
                {'ラ',"..."},
                {'ワ',"-.-"},
                {'イ',".-"},
                {'キ',"-.-.."},
                {'シ',"--.-."},
                {'チ',"..-."},
                {'ニ',"-.-."},
                {'ヒ',"--..-"},
                {'ミ',"..-.-"},
                {'リ',"--."},
                {'ヰ',".-..-"},
                {'ウ',"..-"},
                {'ク',"...-"},
                {'ス',"---.-"},
                {'ツ',".--." },
                {'ヌ',"...." },
                {'フ',"--.." },
                {'ム',"-" },
                {'ユ',"-..--" },
                {'ル',"-.--." },
                {'ン',".-.-." },
                {'エ',"-.---" },
                {'ケ',"-.--" },
                {'セ',".---." },
                {'テ',".-.--" },
                {'ネ',"--.-" },
                {'ヘ',"." },
                {'メ',"-...-" },
                {'レ',"---" },
                {'ヱ',".--.." },
                {'オ',".-..." },
                {'コ',"----" },
                {'ソ',"---." },
                {'ト',"..-.." },
                {'ノ',"..--" },
                {'ホ',"-.." },
                {'モ',"-..-." },
                {'ヨ',"--" },
                {'ロ',".-.-" },
                {'ヲ',".---" },
                {'゛',".." },
                {'゜',"..--." },
                {'。',".-.-.." },
                {'ー',".--.-" },
                {'、',".-.-.-" },
                {'（',"-.--.-" },
                {'）',".-..-." },
               
                //Numerics
                { '1', ".----" },
                { '2', "..--" },
                { '3', "...--" },
                { '4', "....-" },
                { '5', "....." },
                { '6', "-...." },
                { '7', "--..." },
                { '8', "---.." },
                { '9', "----." },
                { '0', "-----" },
                //Space
                {' ', "/" },
                //Punctuation
                {'.',".-.-.-" },
                {',',"--..--" },
                {'?',"..--.." },
                {';',"-.-.-." },
                {':',"---..." },
                {'/',"-..-."},
                {'\'',".----." },
                {'\"',".-..-." },

                {'&',".-..." },
                {'$',"...-..-" },
                {'@',".--.-." },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'!', "-.-.--"},

                //Special Characters
                {'_',"..--.-"},
                {'+',".-.-." },
                {'-',"-....-" },
                {'*',"-..-" },
                {'=',"-...-" },
                {')',"-.--.-" },
                {'(',"-.--." }
            };
        }

        /// <summary>
        /// Defines all morse characters in Portugues.
        /// </summary>
        /// <returns></returns>
        private static Dictionary<char, string> GetMorseCharactersPortugues()
        {

            return new Dictionary<char, string>()
            {
               //Alphabets
                {'A',".-"},
                {'B',"-..." },
                {'C',"-.-."},
                {'D',"-.." },
                {'E',"." },
                {'F',"..-." },
                {'G',"--." },
                {'H',"...." },
                {'I',".." },
                {'J',".---" },
                {'K',"-.-" },
                {'L',".-.." },
                {'M',"--" },
                {'N',"-." },
                {'O',"---" },
                {'P',".--." },
                {'Q',"--.-" },
                {'R',".-." },
                {'S',"..." },
                {'T',"-" },
                {'U',"..-" },
                {'V',"...-" },
                {'W',".--" },
                {'X',"-..-" },
                {'Y',"-.--" },
                {'Z',"--.." },

                {'Ã',".--.-" },
                {'Á',".--.-" },
                {'À',".--.-" },
                {'Â',".--.-" },
                {'Ç',"-.-.." },
                {'É',"..-.." },
                {'Ê',"-..-." },
                {'Ó',"---." },
                {'Ô',"---." },
                
                //Numerics
                { '1', ".----" },
                { '2', "..--" },
                { '3', "...--" },
                { '4', "....-" },
                { '5', "....." },
                { '6', "-...." },
                { '7', "--..." },
                { '8', "---.." },
                { '9', "----." },
                { '0', "-----" },
                //Space
                {' ', "/" },
                //Punctuation
                {'.',".-.-.-" },
                {',',"--..--" },
                {'?',"..--.." },
                {';',"-.-.-." },
                {':',"---..." },
                {'/',"-..-."},
                {'\'',".----." },
                {'\"',".-..-." },

                {'&',".-..." },
                {'$',"...-..-" },
                {'@',".--.-." },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'!', "-.-.--"},

                //Special Characters
                {'_',"..--.-"},
                {'+',".-.-." },
                {'-',"-....-" },
                {'*',"-..-" },
                {'=',"-...-" },
                {')',"-.--.-" },
                {'(',"-.--." }
            };
        }

        /// <summary>
        /// Defines all morse characters in Russian.
        /// </summary>
        /// <returns><see cref="System.Collections.Generic.Dictionary{Char, String}"></see> of morse characters.</returns>
        private static Dictionary<char, string> GetMorseCharactersRussian()
        {

            return new Dictionary<char, string>()
            {
                { 'А', ".-" },
                { 'Б', "-..." },
                { 'В', ".--" },
                { 'Г', "--." },
                { 'Д', "-.." },
                { 'Е', "." },
                { 'Ё', "." },
                { 'Ж', "...-" },
                { 'З', "--.." },
                { 'И', ".." },
                { 'Й', ".---" },
                { 'К', "-.-" },
                { 'Л', ".-.." },
                { 'М', "--" },
                { 'Н', "-." },
                { 'О', "---" },
                { 'П', ".--." },
                { 'Р', ".-." },
                { 'С', "..." },
                { 'Т', "-" },
                { 'У', "..-" },
                { 'Ф', "..-." },
                { 'Х', "...." },
                { 'Ц', "-.-." },
                { 'Ч', "---." },
                { 'Ш', "----" },
                { 'Щ', "--.-" },
                // The value is used as in "Ь", since this symbol has several encoding options, and now it is often replaced by a code from "Ь"
                { 'Ъ', "-..-" }, 
                { 'Ы', "-.--" },
                { 'Ь', "-..-" },
                { 'Э', "..-.." },
                { 'Ю', "..--" },
                { 'Я', ".-.-" },
                // Other cyrillic letters (not russian)
                { 'Ї', ".---." },
                { 'Є', "..-.." },
                { 'І', ".." },
                { 'Ґ', "--." },
                // Numerics
                { '1', ".----" },
                { '2', "..---" },
                { '3', "...--" },
                { '4', "....-" },
                { '5', "....." },
                { '6', "-...." },
                { '7', "--..." },
                { '8', "---.." },
                { '9', "----." },
                { '0', "-----" },
                // Space
                {' ', "/" },
                //Punctuation
                {'.',".-.-.-" },
                {',',"--..--" },
                {'?',"..--.." },
                {';',"-.-.-." },
                {':',"---..." },
                {'/',"-..-."},
                {'\'',".----." },
                {'\"',".-..-." },

                {'&',".-..." },
                {'$',"...-..-" },
                {'@',".--.-." },
                {'¿',"..-.-" },
                {'¡',"--...-" },
                {'!', "-.-.--"},


                //Special Characters
                {'_',"..--.-"},
                {'+',".-.-." },
                {'-',"-....-" },
                {'*',"-..-" },
                {'=',"-...-" },
                {')',"-.--.-" },
                {'(',"-.--." }
            };
        }
    }
}